<?php

//========task_1_Фаренгейт========//
echo "task_1" . PHP_EOL;

$c = 24.7;
$f = $c * 1.8 + 32;
echo "Температура в C = $c" . PHP_EOL
. "Температура в F = $f". PHP_EOL;

echo "================" . PHP_EOL;

//========task_2_Рубли и копейки1========//
echo "task_2" . PHP_EOL;

$r = 199;
$k = 99;
$c = $r * 100 + $k;
echo "Стоимость = $r руб $k коп"
. "Стоимость (коп.) = $c коп" . PHP_EOL;

echo "================" . PHP_EOL;

//========task_3_Гонка========//
echo "task_3" . PHP_EOL;

$h1 = 1;
$m1 = 27;
$s1 = 12;

$h2 = 1;
$m2 = 28;
$s2 = 5;

$time = ($h2 * 360 - $h1 * 360) + ($m2 * 60 - $m1 * 60) + ($s2 - $s1);
echo "Время отставания (сек.) = $time сек" . PHP_EOL;

echo "================" . PHP_EOL;

//========task_4_Скорость========//
echo "task_4" . PHP_EOL;

$t = 45;
$s = 3;

$v = ($s * 1000) / ($t * 60);

echo "Время = $t мин" . PHP_EOL
. "Расстояние = $s км" . PHP_EOL
. "Скорость = $v м/с" . PHP_EOL;

echo "================" . PHP_EOL;

//========task_5_Катеты========//
echo "task_5" . PHP_EOL;

$a = 3;
$b = 4;

$s = 1 / 2 * $a * $b;
$c = $a ** 2 + $b ** 2;

$p = $a + $b + sqrt($c);

echo "Площадь = $s" . PHP_EOL
. "Периметр = $p" . PHP_EOL
. "Гипотенуза = " . sqrt($c) . PHP_EOL;

echo "================" . PHP_EOL;

//========task_6-8_Последняя цифра, Десятки========//
echo "task_6-8" . PHP_EOL;

$a = 124524;
$b = 32;
$c = 9592124;

echo "Последняя цифра = " . $a % 10 . PHP_EOL
. "Число десятков1 = " . (int)($b / 10) . PHP_EOL
. "Число десятков2 = " . (int)($c % 100 / 10) . PHP_EOL;

echo "================" . PHP_EOL;

//========task_9_Рубли и копейки2========//
echo "task_9" . PHP_EOL;

$c = 21857;

echo "Стоимость (руб.) = " . $c / 100 - ($c % 100) / 100 . " руб" . PHP_EOL
. "Стоимость (коп.) = " . $c % 100 . " коп" . PHP_EOL;

echo "================" . PHP_EOL;

//========task_10_Покупки========//
echo "task_10" . PHP_EOL;

$n = 6;
$r = 529;
$k = 98;

// $c = $n * ($r * 100 + $k);

echo "Стоимость (руб.) = " . $n * $r + ($n * $k - ($n * $k % 100)) / 100 . " руб" . PHP_EOL
. "Стоимость (коп.) = " . $n * $k % 100 . " коп" . PHP_EOL;

echo "================" . PHP_EOL;

//========task_11_Квадраты========//
echo "task_11" . PHP_EOL;

$n = 10;
$m = 20;
$k = 5;

$res = $n / $k * $m / $k;

echo "Количество квадратов = $res" . PHP_EOL;

echo "================" . PHP_EOL;
